# date: 30/11/2023
# context for question-answering model AI

context1 = """
Дисциплина: Проектный практикум
Предмет: Проектный практикум
Наша группа №5.
Мы учимся в УРФУ.
Состав команды: Клим Колчин, Татьяна Меркурьева, Игорь Ерошин, Вадим Монахов, Олег Перевиспа, Евгений Брылин
Лидер команды Игорь Ерошин.
Самый умный среди нас видимо Вадим Монахов, во всяком случае он умеет в МОАД.
Наша тема: Помощник студента
Наша цель: Мы хотим сделать днищенский помощник, который практически не будет помогать студенту. 
За нашу работу мы хотим получить зачет по Проектному практикуму. 
Анализ проблемы - мы не проводили никакой анализ и не хотим вообще запариваться по этому поводу
"""